'''
高级切片
1. 切片和区间会忽略最后一个元素
2. 对对象进行切片
3. 多维切片
4. 切片赋值
'''

'''1. 切片忽略最后一个元素'''
l = [10, 20, 30, 40, 50, 60]
print(l[: 2])  # [10, 20]
print(l[2:])  # [30, 40, 50, 60]

'''2. 对对象进行切片'''
s = 'bicycle'
print(s[::3])  # 'bye'
print(s[::-2])  # 'eccb'

'''3. 多维切片和省略'''
# f(a, ..., z)

'''4. 切片赋值'''
l = list(range(10))
l[2:5] = [20, 30]
print(l)  # [0, 1, 20, 30, 5, 6, 7, 8, 9]

'''5. 对序列使用+和*'''
# 对列表, 字符串进行拼接
# 不修改原有的操作对象,构建全新的序列
l = [1, 2, 3]
print(l * 5) # [1, 2, 3, 1, 2, 3, 1, 2, 3, 1, 2, 3, 1, 2, 3]
print(5 * 'abc') # abcabcabcabcabc




